Education/IEEE 11073 SDC/Medical_Devices_Profile_for_Web_Services/DPWS_Messages/ProbeMatches.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:pm="http://p11073-10207/draft6/pm/2016/12/08" xmlns:ext="http://p11073-10207/draft6/ext/2016/12/08" xmlns:dpws="http://docs.oasis-open.org/ws-dd/ns/dpws/2009/01" xmlns:si="http://standards.ieee.org/downloads/11073/11073-20702-2016/" xmlns:msg="http://p11073-10207/draft6/msg/2016/12/08" xmlns:wsd11="http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01" xmlns:wse4="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:wst4="http://schemas.xmlsoap.org/ws/2004/09/transfer" xmlns:wsx4="http://schemas.xmlsoap.org/ws/2004/09/mex">
	<SOAP-ENV:Header>
		<wsa5:MessageID>urn:uuid:f11068cf-739a-4861-9da4-bea95d3fb7eb</wsa5:MessageID>
		<wsa5:RelatesTo RelationshipType="http://www.w3.org/2005/08/addressing/reply">urn:uuid:ef865030-1c5e-11e7-808a-c247d6c531f6</wsa5:RelatesTo>
		<wsa5:To SOAP-ENV:mustUnderstand="true">http://www.w3.org/2005/08/addressing/anonymous</wsa5:To>
		<wsa5:Action SOAP-ENV:mustUnderstand="true">http://docs.oasis-open.org/ws-dd/ns/discovery/2009/01/ProbeMatches</wsa5:Action>
		<wsd11:AppSequence InstanceId="1000" SequenceId="ws-discovery-sequence" MessageNumber="1"/>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
		<wsd11:ProbeMatches>
			<wsd11:ProbeMatch xmlns:_0="http://p11073-20701/2016/12/08">
				<wsa5:EndpointReference>
					<wsa5:Address>urn:uuid:426896ea-edb7-425c-a4a3-ef7e892e94f4</wsa5:Address>
				</wsa5:EndpointReference>
				<wsd11:Types>dpws:Device _0:MedicalDevice</wsd11:Types>
				<wsd11:Scopes/>
				<wsd11:XAddrs>http://10.52.219.53:54556/426896ea-edb7-425c-a4a3-ef7e892e94f4/</wsd11:XAddrs>
				<wsd11:MetadataVersion>1000</wsd11:MetadataVersion>
			</wsd11:ProbeMatch>
		</wsd11:ProbeMatches>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
